Revit 2027 API
View.IsolateElementTemporary Method
 Set one element to be temporarily isolated in the view. To isolate a group completely, you must also include all members of all groups and nested groups in your input, therefore you should use the version of this method that accepts multiple element ids as input.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void IsolateElementTemporary(
	ElementId elementId
)
Public Sub IsolateElementTemporary (
	elementId As ElementId
)
public:
void IsolateElementTemporary(
	ElementId^ elementId
)
member IsolateElementTemporary :
        elementId : ElementId -> unit
Parameters
elementId ElementId
 Id of element to be isolated.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
View Class
Autodesk.Revit.DB Namespace